{
  "emails": [
    {
      "id": 1,
      "from": "admin@gmail.com",
      "subject": "What are spam emails?",
      "body": "Spam emails are emails sent to you without your knowledge or consent, which often contain marketing. It is email that you don’t want and didn’t ask for, and its content can cause annoyance, embarrassment and even distress. However, it’s worth remembering that the sender generally doesn’t target recipients personally. The same spam email can be sent to millions of people at the same time and the addresses can often be guessed.",
      "sentAt": "2020-03-27T18:25:43.511Z",
      "archived": false,
      "read": true
    },
    {
      "id": 2,
      "from": "phonekhainghein@gmail.com",
      "subject": "What does the law say?",
      "body": "The Privacy and Electronic Communications Regulations 2003 (PECR) cover the sending of marketing emails.\nThis legislation says that organisations must only send marketing emails to individuals if you have agreed to receive them, except where there is a clearly defined customer relationship.\nThe ICO can only investigate complaints about marketing emails from identifiable UK senders. As a lot of spam emails come from outside the UK, the Information Commissioner has an agreement with a number of overseas bodies to cooperate and exchange information to try and stop spam emails that are sent from those places.",
      "sentAt": "2020-05-20T18:25:43.511Z",
      "archived": false,
      "read": true
    },
    {
      "id": 3,
      "from": "rimuru@gmail.com",
      "subject": "#177: Updated Vue.js Roadmap; Vuex v4.0.0-alpha.1 has been released; Kia King Ishii join the core team; Nuxt v2.12 released; Videos from Vue.js Amsterdam 2020 are here!",
      "body": "First of all, lets congratulate Kia King Ishii on joining the Vue.js core team! 🎉 He has been doing an incredible job building vuex-orm and will now focus on working on the next versions of Vuex.\n\nSpeaking of which – Vuex v4.0.0-alpha.1 has just been released! This is the version of Vuex that will work with Vue 3.0 but keep the familiar API you know from the current version.",
      "sentAt": "2020-03-18T18:25:43.511Z",
      "archived": false,
      "read": true
    },
    {
      "id": 4,
      "from": "lucifer@developer.com",
      "subject": "'Vue 3 Release Roadmap' + 6 more must-read articles from this week",
      "body": "Newsletter Issue #161",
      "sentAt": "2020-03-24T18:25:43.511Z",
      "archived": true,
      "read": true
    }
  ]
}
